---
kind: property
id: P:Autodesk.Revit.DB.MeshFromGeometryOperationResult.Tessellated
source: html/30d4e459-7217-20bd-9192-b5253ea78792.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationResult.Tessellated Property

Whether while constructing a mesh, it was necessary
 to extrude polylines instead of non-linear curves
 from the profile loops.

## Syntax (C#)
```csharp
public bool Tessellated { get; }
```